function sayHello(name) {
    return console.log(`Привет ${name}`);
}

sayHello("Roman");

// 2) Создайте функцию, которая принимает в себя 1 аргумент в виде целого числа и возвращает массив из трех чисел: одно на 1 меньше, сам аргумент, и число на 1 больше.

// Пример: вызов функции returnNeighboringNumbers(5) возвращает массив в виде [4, 5, 6]. 

// function returnNeighboringNumbers(number) {
//     let array = [];
//     array[0] = number - 1;
//     array[1] = number;
//     array[2] = number + 1;
//     console.log(array);
//     return array;
// }

// returnNeighboringNumbers(2);

// 3) Создайте функцию, которая будет принимать в себя 2 аргумента, оба числа. Первое число - это база, второе число - это сколько раз нужно будет 
//повторить это число в прогрессии. (Смотри пример ниже). Функция должна возвращать строку (или число в особых случаях, о которых ниже), где эти числа идут 
//по порядку, разделенные тремя дефисами "---". После последнего числа их не должно быть.

// Если второй аргумент не является числом, равен или меньше нуля - то возвращать просто первый аргумент. (Проверяем через оператор typeof)

// Примеры:

// Вызов функции getMathResult(5, 3) даст ответ 5---10---15

// Вызов функции getMathResult(3, 10) даст ответ 3---6---9---12---15---18---21---24---27---30

// Вызов функции getMathResult(10, 5) даст ответ 10---20---30---40---50

// Вызов функции getMathResult(10, '5') даст ответ 10

// Вызов функции getMathResult(10, 0) даст ответ 10

// Вызов функции getMathResult(20, -5) даст ответ 20

// Эта задача уже ближе к реальности, когда вам нужно учитывать и тип данных у аргументов, проверять их и продумывать логику работы внутри.
//Обратите внимание на прогрессию, она рассчитывается по простой формуле умножения. Если первый аргумент 5, а второй 3, то число повторяется 3 раза, 
//каждый раз увеличиваясь на само себя. Это базовая математика, которая и нужна для работы в 95% случае на фронтенде.

// Место для третьей задачи
function getMathResult(first, second) {
    let result = "";

    if (typeof(second) != "number" || second <= 0) {
        result = first;
        console.log(first);
    } else {
        for (let i = 1; i <= second; i++) {
            result += first * i;
            if (i != second) {
                result += "---";
            } else {break;}
        }
        console.log(result);    
    }
    return result;    
}

getMathResult(2,4);
getMathResult(5,"dsda");